---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BackgroundDraftPatternIdParam
source: html/67d50d01-5563-569c-a844-027e1010513c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BackgroundDraftPatternIdParam Property

"Background Fill Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId BackgroundDraftPatternIdParam { get; }
```